# medium  Визначте назву геометричної фігури за введеною кількістю її сторін. Програма повинна підтримувати фігури від
# 3 до 6 сторін. Якщо введена кількість сторін поза межами цього діапазону, програма
# повинна відображати відповідне повідомлення.
#

# number= int(input())
# if number == 3:
#     print("That's a triangle.")
#
# elif number== 4:
#     print("That's a quadrilateral.")
#
# elif number== 5:
#     print("That's a pentagon.")
#
# elif number== 6:
#     print("That's a hexagon.")
#
# else:
#     print("That number of sides is not supported by this program")









# HIGH
# 174 Потрібно визначити, чи є даний рік високосним. Нагадаємо, що високосними
# роками вважаються ті роки, порядковий номер яких або кратний 4, але при цьому не
# # кратний 100, або кратний 400 (наприклад, 2000-й рік був високосним,
# # а 2100-й буде невисокосним роком). Програма повинна коректно працювати на числах 1900 ≤ n ≤ 3000.
# # Виведіть Leap year. в разі, якщо рік є високосним, і Ordinary year. у протилежному випадку.
#
# year= int(input())
# if year%4==0 and year%100!=0:
#     print('Leap year')
# else:
#     print('Ordinary year')
#
#
#
# 175: Дано чотирицифрове число. Визначити, чи дорівнює сума двох перших його цифр сумі двох його останніх цифр.
# number= (input())
#
# if int(str(number)[0])+int(str(number)[1])==int(str(number)[-1])+int(str(number)[-2]):
#     print(f'{True}')
# else:
#     print(f'{False}')
#

# 176:Дано чотирицифрове число. Замінити усі парні цифри числа на символ * і вивести число.
# Дано чотирицифрове число. Замінити усі парні цифри числа на символ * і вивести число.

number= (input())

i =0
while i <3:
    if int(str(number)[i]) % 2 == 0:
        number[i] = '*'
        print(number)
i = i+1
