# 1. Напишіть програму, яка отримує три цілих числа, введені з клавіатури
# (кожне число вводиться на окремому рядку), і друкує на екрані їх суму, добуток,
# результат піднесення першого числа до степеня різниці другого і третього чисел.
# Вхідні дані:
#
# 2
# 3
# 6
# Вихідні дані:
#
# 11
# 36
# 0.125
#
#
# digit1=int(input())
# digit2=int(input())
# digit3=int(input())
#
# print (int(digit1+digit2+digit3))
# print (int(digit1*digit2*digit3))
# print (round((digit1**(digit2-digit3)),3))


# 2. Напишіть програму, яка приймає ціле число n і обчислює значення виразу n + nn + nnn.
#
# Вхідні дані:
#
# 5
# 3
# 1
# Вихідні дані:
#
# 615
# 369
# 123
# int1=int(input())
# print(int1+int1*10+int1+int1*100+int1*10+int1)

# 6. Вводиться ціле додатне число. Надрукуйте останню цифру числа.
# n= int(input())
# lastdigit = int(repr(n)[-1])
# print (lastdigit)

# Напишіть програму, щоб перетворити ціле число в бінарне (двійкове).
# Передбачте зберігання провідних нулів у двійковому записі.
# n= int(input())
# print (bin(n))



# Школа вирішила замінити парти у трьох кабінетах.
# Кожна парта розрахована на двох учнів. Враховуючи кількість учнів
# у кожному класі, надрукуйте найменшу можливу кількість парт, які треба
# придбати. Програма повинна прочитати три
# цілих числа: кількість учнів в кожному з трьох класів a, b та c відповідно.
number1= int(input())
number2= int(input())
number3= int(input())

print(int(round(number1+number2+number3)/2))


