# Один з астрологів визначає щасливі і нещасливі дні так:
# він записує підряд число, номер місяця і рік. В отриманому
# числі додає всі цифри, в новому отриманому числі знову додає всі цифри і так далі,
# доки чергова сума цифр не стане однозначним числом. Це число і характеризує щасливість дня.
# Дата зберігається в форматі ррррммдд у файлі. Збережіть рядок,
# який містить одне число, що визначає щасливість дати, у інший файл.


with open('input743.txt', 'r') as input:
    data = input.read().strip()
    sum = 0
    for each in data:
        sum = sum + int(each)
with open('output7483.txt', 'w') as output:
    output.write(str(sum))
